<a href="https://colab.research.google.com/github/smiledinisa/data_python_analysis/blob/master/pandas004_DataWrangling.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# CAHPER 8 : Data Wrangling : Join, Combine and Reshape

In [ ]:
import numpy as np
from pandas import Series as Series
from pandas import DataFrame as DataFrame

## Hirerarchical Indexing


hirearchial indexing is used extensively in some of the manipulations.

provides a way for you to work with higher dimenssion data in a lower 
dimenssion form.

用处广泛，以低维的方法处理高维的数据提供了便利。

In [ ]:
data = Series(np.random.randn(9), index = [['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])


data

a  1    1.284930
   2   -0.524601
   3    1.520868
b  1    0.298517
   3    0.591261
c  1   -1.047802
   2    0.354460
d  2    1.079982
   3   -1.187737
dtype: float64

In [ ]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [ ]:
#With a hierarchically indexed object, so-called partial indexing is possible, enabling
# you to concisely select subsets of the data:
# 分层索引使得局部索引成为可能。

data['b']

1    0.298517
3    0.591261
dtype: float64

In [ ]:
data['b':'c']

b  1    0.298517
   3    0.591261
c  1   -1.047802
   2    0.354460
dtype: float64

In [ ]:
data.loc[['b','c']]

b  1    0.298517
   3    0.591261
c  1   -1.047802
   2    0.354460
dtype: float64

In [ ]:
data.loc[:,2]

a   -0.524601
c    0.354460
d    1.079982
dtype: float64

In [ ]:
# 多层索引的unstack 方法b
 
data.unstack()

          1         2         3
a  1.284930 -0.524601  1.520868
b  0.298517       NaN  0.591261
c -1.047802  0.354460       NaN
d       NaN  1.079982 -1.187737

In [ ]:
# inverse operation of unstack is stack.
data.unstack().stack()

a  1    1.284930
   2   -0.524601
   3    1.520868
b  1    0.298517
   3    0.591261
c  1   -1.047802
   2    0.354460
d  2    1.079982
   3   -1.187737
dtype: float64

With a DataFrame, either axis can have a hierarchical index:

各个轴都可以由 多层索引。

In [ ]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
          index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
          columns=[['Ohio', 'Ohio', 'Colorado'],
          ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [ ]:
frame.index.names

FrozenList([None, None])

In [ ]:
frame.columns.names

FrozenList([None, None])

In [ ]:
# hierarchical levels can have names


frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']

In [ ]:
print(frame.index.names)
print(frame.columns.names)

['key1', 'key2']
['state', 'color']

In [ ]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [ ]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [ ]:
frame['Ohio'].loc['a'] # 可以组合使用。

color  Green  Red
key2
1          0    1
2          3    4

In [ ]:
# A  MultiIndex can be created by itself and then reused; the columns in the preceding
# DataFrame with level names could be created like this:
import pandas as pd
mul_col = pd.MultiIndex.from_arrays([['Ohio', 'Ohio','Colorado'], ['green','red','green']], names = ['state', 'color'])

In [ ]:
x = DataFrame(np.arange(12).reshape((4, 3)),
          index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
          columns=mul_col)
x

state  Ohio     Colorado
color green red    green
a 1       0   1        2
  2       3   4        5
b 1       6   7        8
  2       9  10       11

### Reordering and Sorting Levels


At times we need to rearrange the order of the levels.

有时候我们需要对索引的级别重新排列。


keyward: ***swaplevel***.

In [ ]:
x

state  Ohio     Colorado
color green red    green
a 1       0   1        2
  2       3   4        5
b 1       6   7        8
  2       9  10       11

In [ ]:
x.swaplevel('state','color',axis=1)

color green  red    green
state  Ohio Ohio Colorado
a 1       0    1        2
  2       3    4        5
b 1       6    7        8
  2       9   10       11

In [ ]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [ ]:
frame.swaplevel('key1','key2',axis=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [ ]:
# 我们对dataframe的value进行排序，按某一个index或者axis

frame.sort_index(level=1,axis=0,ascending=True, inplace= False, kind='quicksort')

# 除了level 其他参数都是默认的。 方便我们进行控制。

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [ ]:
frame.sort_index(level=0,axis=0,ascending=True, inplace= False, kind='quicksort')

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [ ]:
frame.swaplevel(0,1).sort_index(level = 0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### Summary Statistics by Level

按索引级别的分层概要统计。

In [ ]:
# 一般来说，统计function都是含有level选项参数的。
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [ ]:
frame.sum(level= 'color', axis= 1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Indexing with a DataFrame's columns

It’s not unusual to want to use one or more columns from a DataFrame as the row
index; alternatively, you may wish to **move the row index into the DataFrame**’s col‐
umns. Here’s an example DataFrame:

keyward: ***set_index,reset_index***

想将index 转换为行，或者将columns转换为index

In [2]:
import pandas as pd
import numpy as np
from pandas import DataFrame
from pandas import Series

frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
            'c': ['one', 'one', 'one', 'two', 'two',
            'two', 'two'],
            'd': [0, 1, 2, 0, 1, 2, 3]})

In [4]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [6]:
# set_index.

frame2 = frame.set_index(['c'])
frame2

     a  b  d
c
one  0  7  0
one  1  6  1
one  2  5  2
two  3  4  0
two  4  3  1
two  5  2  2
two  6  1  3

In [12]:
frame2 = frame.set_index(['c','d'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [11]:
# default,drop the columns we changged. but if want to leave them :

frame3 = frame.set_index(['c','d'], drop=False)
frame3

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [13]:
# keyward : reset_index:

frame4 = frame2.reset_index() # 默认会将全部的index转换成columns ,but we can specify the index.
frame4

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [15]:
frame4 = frame2.reset_index(level=1, drop= False) 
frame4

     d  a  b
c
one  0  0  7
one  1  1  6
one  2  2  5
two  0  3  4
two  1  4  3
two  2  5  2
two  3  6  1

## Combining and Merging Datasets



1.   ***pandas.merge*** : like database join. connects rows in DataFrame based on keys.

2.   ***pandas.concat*** : concatenates or 'stacks' along an axis.

3.   ***combine_first*** : splicing together overlapping data to fill in missing values in one object with values from another.




链接方法how= 可用的关键字。
---
![链接文字](https://img-blog.csdnimg.cn/20200816104752960.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9ibG9nLmNzZG4ubmV0L2dhb2N1aTg4Mw==,size_16,color_FFFFFF,t_70#pic_center)
---
---

![链接文字](https://img-blog.csdnimg.cn/20200816112055826.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9ibG9nLmNzZG4ubmV0L2dhb2N1aTg4Mw==,size_16,color_FFFFFF,t_70#pic_center)
---

### Database-Style DataFrame Joins

In [18]:
# merge 

df1 = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
          'data1': range(7)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [16]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
          'data2': range(3)})
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [19]:
pd.merge(df1,df2)  # 默认对相同的名字的coloumn进行链接。

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [20]:
# 也可对链接的名进行指定。
pd.merge(df1,df2, on= 'key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [21]:
# 如果两个dataframe名有相同的列明的话。

df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
            'data1': range(7)})

df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
            'data2': range(3)})
print(df3)
print(df4)

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6
  rkey  data2
0    a      0
1    b      1
2    d      2

In [22]:
pd.merge(df3,df4, left_on='lkey',right_on='rkey', how = 'inner')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [24]:
pd.merge(df4,df3, left_on='rkey',right_on='lkey', how = 'inner')

  rkey  data2 lkey  data1
0    a      0    a      2
1    a      0    a      4
2    a      0    a      5
3    b      1    b      0
4    b      1    b      1
5    b      1    b      6

In [25]:
# by default, how = 'inner', but we can specify the keyward: left,right,outer. 
# they are all like method in sql.

pd.merge(df3,df4, left_on='lkey',right_on='rkey', how='left')

  lkey  data1 rkey  data2
0    b      0    b    1.0
1    b      1    b    1.0
2    a      2    a    0.0
3    c      3  NaN    NaN
4    a      4    a    0.0
5    a      5    a    0.0
6    b      6    b    1.0

In [26]:
pd.merge(df3,df4, left_on='lkey',right_on='rkey', how='right')

  lkey  data1 rkey  data2
0    b    0.0    b      1
1    b    1.0    b      1
2    b    6.0    b      1
3    a    2.0    a      0
4    a    4.0    a      0
5    a    5.0    a      0
6  NaN    NaN    d      2

In [27]:
pd.merge(df3,df4, left_on='lkey',right_on='rkey', how='outer')

  lkey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0
6    c    3.0  NaN    NaN
7  NaN    NaN    d    2.0

In [30]:
# multiple keys. pass a list of column names:

left = DataFrame({'key1': ['foo', 'foo', 'bar'],
          'key2': ['one', 'two', 'one'],
          'lval': [1, 2, 3]})
right = DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
            'key2': ['one', 'one', 'one', 'two'],
            'rval': [4, 5, 6, 7]})

print(left)
print(right)

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3
  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [34]:
pd.merge(left,right, how='outer', on=['key1', 'key2'])

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [ ]:
# if we only merge on the key1:

In [35]:
pd.merge(left,right, how='outer', on=['key1'])

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [36]:
# we can see that key2'name changged : by default the columns didnt merge,but have the same columnname ,will 
# change _x at left, _y at the right.

# but we can change this by set the option keyward: suffixes = ('chars we want set.')

pd.merge(left,right, how='outer', on=['key1'], suffixes=('_mother', '_dady'))

  key1 key2_mother  lval key2_dady  rval
0  foo         one     1       one     4
1  foo         one     1       one     5
2  foo         two     2       one     4
3  foo         two     2       one     5
4  bar         one     3       one     6
5  bar         one     3       two     7

### Merging on Index

In some cases, the merge key(s) in a DataFrame will be found in its index. In this
case, you can pass  **left_index=True** or  **right_index=True** (or both) to indicate that
the index should be used as the merge key:


很多情况下，我们并不是以列来对dataframe进行链接，而是以index作为key来对dataframe进行链接的，这种情况下需要指定 

merge的option参数： l**eft_index = TRUE**,和**right_index = true.**

In [37]:
left1 = DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
          'value': range(6)})

right1 = DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

print(left1)
print(right1)

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5
   group_val
a        3.5
b        7.0

In [38]:
# 可以看出，left1 有一列名为 abac....
# 而right1 的index 则是abab。。。
# 用left1 的key与right1 的index进行链接。


pd.merge(left1,right1, left_on='key', right_on= None, left_index= False, right_index= True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [39]:
# with hierarchically indexed data, more complicated .

# 因为是隐式的多级合并。

lefth = DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio',
'Nevada', 'Nevada'],
'key2': [2000, 2001, 2002, 2001, 2002],
'data': np.arange(5.)})

righth = pd.DataFrame(np.arange(12).reshape((6, 2)),
index=[['Nevada', 'Nevada', 'Ohio', 'Ohio',
'Ohio', 'Ohio'],
[2001, 2000, 2000, 2000, 2001, 2002]],
columns=['event1', 'event2'])

lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [40]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [44]:
# 其实就是组合索引的链接。本来没有出现的组合，并不会重新出现。
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index= True, how='inner')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

In [45]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index= True, how='outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

In [46]:
# 两边的索引都用，也是可以的。
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
            index=['a', 'c', 'e'],
            columns=['Ohio', 'Nevada'])

right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
            index=['b', 'c', 'd', 'e'],
            columns=['Missouri', 'Alabama'])
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [47]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [48]:
pd.merge(left2,right2, how='outer', left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [49]:
# dataframe 还有 join方法来对index进行链接，但是要求列明没有重复的。

left2.join(right2,how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [50]:
# 当然，join也可以链接指定列名，但是默认只是进行左连接。也就是保持左边的dataframe保持不变。
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [51]:
right1

   group_val
a        3.5
b        7.0

In [52]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [53]:
another = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]],
              index=['a', 'c', 'e', 'f'],
              columns=['New York', 'Oregon'])

# 多列表链接, 直接传一个dataframe列表。

left2.join([right2,another], how='outer')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0
b   NaN     NaN       7.0      8.0       NaN     NaN
d   NaN     NaN      11.0     12.0       NaN     NaN
f   NaN     NaN       NaN      NaN      16.0    17.0

### Concatenating Along an Axis

### Combining Data wtih Overlap

## Reshaping and Pivoting

### Reshaping with Hierarchical Indexing

### Pivoting "Long" to "Wide" Format

### Pivoting "Wide" to "Long" Format